// Задача 36: Задайте одномерный массив, заполненный случайными числами. Найдите сумму элементов с нечётными индексами.
// [3, 7, 23, 12] -> 19
// [-4, -6, 89, 6] -> 0


// int sum = 0;
// Random rand = new Random();
// int[] array = new int[4];

// for (int i = 0; i < 4; i++) {
//     array[i] = rand.Next(-50, 50);
// }

// for (int i = 1; i < 4; i += 2) {
//     sum += array[i];
// }    

// var str = string.Join(", ", array);

// Console.WriteLine($"Сумма элементов в масиве: [{str}] -> {sum}");